console.log(
    "Требования к верстке 100/100\n" +
    "1. Вёрстка страницы Main соответствует макету при ширине экрана 1280px — 14/14\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tблок <header>\n" +
    "\n" +
    "\t2/2 \tблок Not only\n" +
    "\n" +
    "\t2/2 \tблок About\n" +
    "\n" +
    "\t2/2 \tблок Our Friends\n" +
    "\n" +
    "\t2/2 \tблок Help\n" +
    "\n" +
    "\t2/2 \tблок In addition\n" +
    "\n" +
    "\t2/2 \tблок <footer>\n" +
    "2. Вёрстка страницы Main соответствует макету при ширине экрана 768px — 14/14\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tблок <header>\n" +
    "\n" +
    "\t2/2 \tблок Not only\n" +
    "\n" +
    "\t2/2 \tблок About\n" +
    "\n" +
    "\t2/2 \tблок Our Friends\n" +
    "\n" +
    "\t2/2 \tблок Help\n" +
    "\n" +
    "\t2/2 \tблок In addition\n" +
    "\n" +
    "\t2/2 \tблок <footer>\n" +
    "3. Вёрстка страницы Main соответствует макету при ширине экрана 320px — 14/14\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tблок <header>\n" +
    "\n" +
    "\t2/2 \tблок Not only\n" +
    "\n" +
    "\t2/2 \tблок About\n" +
    "\n" +
    "\t2/2 \tблок Our Friends\n" +
    "\n" +
    "\t2/2 \tблок Help\n" +
    "\n" +
    "\t2/2 \tблок In addition\n" +
    "\n" +
    "\t2/2 \tблок <footer>\n" +
    "4. Вёрстка страницы Pets соответствует макету при ширине экрана 1280px — 6/6\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tблок <header>\n" +
    "\n" +
    "\t2/2 \tблок Our Friends\n" +
    "\n" +
    "\t2/2 \tблок <footer>\n" +
    "5. Вёрстка страницы Pets соответствует макету при ширине экрана 768px — 6/6\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tблок <header>\n" +
    "\n" +
    "\t2/2 \tблок Our Friends\n" +
    "\n" +
    "\t2/2 \tблок <footer>\n" +
    "6. Вёрстка страницы Pets соответствует макету при ширине экрана 320px — 6/6\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tблок <header>\n" +
    "\n" +
    "\t2/2 \tблок Our Friends\n" +
    "\n" +
    "\t2/2 \tблок <footer>\n" +
    "7. Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки. Весь контент страницы при этом сохраняется: не обрезается и не удаляется — 20/20\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t5/5 \tна странице Main нет полосы прокрутки при ширине от 1280рх до 768рх\n" +
    "\n" +
    "\t5/5 \tна странице Main нет полосы прокрутки при ширине от 768рх до 320рх\n" +
    "\n" +
    "\t5/5 \tна странице Pets нет полосы прокрутки при ширине от 1280рх до 768рх\n" +
    "\n" +
    "\t5/5 \tна странице Pets нет полосы прокрутки при ширине от 768рх до 320рх\n" +
    "8. Верстка резиновая — 8/8\n" +
    "\n" +
    "    ℹ При плавном изменении размера экрана элементы верстки так же плавно меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции\n" +
    "\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t4/4 \tНа странице Main\n" +
    "\n" +
    "\t4/4 \tНа странице Pets\n" +
    "9. При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню — 4/4\n" +
    "\n" +
    "    ⚠ Открытие меню при клике на иконку бургер-меню на текущем этапе не проверяется\n" +
    "\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t2/2 \tНа странице Main\n" +
    "\n" +
    "\t2/2 \tНа странице Pets\n" +
    "10. Верстка обеих страниц валидная. — 8/8\n" +
    "\n" +
    "    ℹ Для проверки валидности вёрстки используйте сервис https://validator.w3.org/\n" +
    "\n" +
    "Status \tScores \tTask\n" +
    "\n" +
    "\t4/4 \tНа странице Main\n" +
    "\n" +
    "\t4/4 \tНа странице Pets" +
    "" +
    ""
)